If I modify the `source_details` block, Terraform will destroy and recreate the volume group and that's not acceptable. See below:

#### volume_group.auto.tfvars
```availability_domain = 1
compartment_id      = "ocid1.compartment.oc1..aaaaaaaahaz26fqhyi3fezbueousr53okuox7iayrmqik4hatmq6o3i3f35q"
source_details = {
  type       = "volumeGroupReplicaId"
  volume_ids = ["ocid1.volumegroupreplica.oc1.eu-amsterdam-1.abqw2ljrp6mhaiape2fuyq27c32m6wyiwowida3hmwe4x25te2st2jet5cua"]
}
```

#### Actual behaviour
```
Terraform will perform the following actions:

  # oci_core_volume_group.this must be replaced
-/+ resource "oci_core_volume_group" "this" {
      + backup_policy_id           = (known after apply)
      + cluster_placement_group_id = (known after apply)
      ~ defined_tags               = {
          - "Oracle-Tags.CreatedBy" = "default/bogdan.m.darie@oracle.com"
          - "Oracle-Tags.CreatedOn" = "2024-07-24T14:04:07.438Z"
        } -> (known after apply)
      ~ freeform_tags              = {} -> (known after apply)
      ~ id                         = "ocid1.volumegroup.oc1.eu-frankfurt-1.abtheljr6nab25enaz57a5rwj6dxmvdnlznmev5k3c7ckp4vws4jzpi462fq" -> (known after apply)
      + is_hydrated                = (known after apply)
      ~ size_in_gbs                = "50" -> (known after apply)
      ~ size_in_mbs                = "51200" -> (known after apply)
      ~ state                      = "AVAILABLE" -> (known after apply)
      ~ time_created               = "2024-07-24 14:04:07.528 +0000 UTC" -> (known after apply)
      ~ volume_ids                 = [
          - "ocid1.volume.oc1.eu-frankfurt-1.abtheljrhn3wztyhv425s6imkxp4xkzd6y2ye6tkrudr6tn57drunbqbnkaa",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ source_details {
          ~ type                    = "volumeIds" -> "volumeGroupReplicaId" # forces replacement
          ~ volume_ids              = [ # forces replacement
              - "ocid1.volume.oc1.eu-frankfurt-1.abtheljrhn3wztyhv425s6imkxp4xkzd6y2ye6tkrudr6tn57drunbqbnkaa",
              + "ocid1.volumegroupreplica.oc1.eu-amsterdam-1.abqw2ljrp6mhaiape2fuyq27c32m6wyiwowida3hmwe4x25te2st2jet5cua",
            ]
            # (3 unchanged attributes hidden)
        }

      ~ volume_group_replicas {
          ~ volume_group_replica_id = "ocid1.volumegroupreplica.oc1.eu-amsterdam-1.abqw2ljrp6mhaiape2fuyq27c32m6wyiwowida3hmwe4x25te2st2jet5cua" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ id                    = "ocid1.volumegroup.oc1.eu-frankfurt-1.abtheljr6nab25enaz57a5rwj6dxmvdnlznmev5k3c7ckp4vws4jzpi462fq" -> (known after apply)
  ~ volume_group_replicas = [
      ~ {
          ~ volume_group_replica_id = "ocid1.volumegroupreplica.oc1.eu-amsterdam-1.abqw2ljrp6mhaiape2fuyq27c32m6wyiwowida3hmwe4x25te2st2jet5cua" -> (known after apply)
            # (2 unchanged attributes hidden)
        },
    ]
```

